\documentclass[12pt,a4paper]{amsart}
\usepackage{amssymb}
\usepackage[a4paper,left=2.25cm,right=2.25cm,top=3cm,bottom=3cm,headsep=1cm]{geometry}
\usepackage{tikz}%\usetikzlibrary{fit,positioning,matrix,calc,decorations.markings,angles,decorations.pathmorphing,decorations.pathreplacing}%,matrix,fit,shapes.geometric}
\title{Example file for M2inTeX}
\author{Paul Zinn-Justin}
\begin{document}
\maketitle

\section{Introduction}
some basic examples:
\smallskip
% start M2
\begin{verbatim}
i1 : R=QQ[x,y]; factor(x^3-y^3)
\end{verbatim}
\noindent\underline{\tt o2}\verb| = |$\left(x-y\right)\left(x^{2}+x\,y+y^{2}\right)$

\noindent\underline{\tt o2}\verb| : |$\texttt{Expression}$ of class $\texttt{Product}$
% start M2
\begin{verbatim}
i3 : res coker vars R
\end{verbatim}
\noindent\underline{\tt o3}\verb| = |$\underset{\vphantom{\Big|}0}{R^{1}}\,\xleftarrow{\left(\begin{smallmatrix}
x&y\\
\end{smallmatrix}\right)}\,\underset{\vphantom{\Big|}1}{R^{2}}\,\xleftarrow{\left(\begin{smallmatrix}
-y\\
x\\
\end{smallmatrix}\right)}\,\underset{\vphantom{\Big|}2}{R^{1}}\,\xleftarrow{0}\,\underset{\vphantom{\Big|}3}{0}$

\noindent\underline{\tt o3}\verb| : |$\texttt{ChainComplex}$
% start M2
\begin{verbatim}
i4 : OO_(Proj(R/(x^3-y^3)))^{1,2}
\end{verbatim}
\noindent\underline{\tt o4}\verb| = |${\mathcal O}_{\texttt{Proj}\left(\frac{R}{x^{3}-y^{3}}\right)}^{1}\left(1\right)\ \oplus \ {\mathcal O}_{\texttt{Proj}\left(\frac{R}{x^{3}-y^{3}}\right)}^{1}\left(2\right)$

\noindent\underline{\tt o4}\verb| : |coherent sheaf on $\texttt{Proj}\left(\frac{R}{x^{3}-y^{3}}\right)$, free
\smallskip

more:
\smallskip
% start M2
\begin{verbatim}
i5 : 318/46
\end{verbatim}
\noindent\underline{\tt o5}\verb| = |$\frac{159}{23}$

\noindent\underline{\tt o5}\verb| : |${\mathbb Q}$
% start M2
\begin{verbatim}
i6 : exp 3.73767
\end{verbatim}
\noindent\underline{\tt o6}\verb| = |${42}$

\noindent\underline{\tt o6}\verb| : |${\mathbb R}$ (of precision $53$)
\smallskip

strings:
\smallskip
% start M2
\begin{verbatim}
i7 : "hehe"
\end{verbatim}
\noindent\underline{\tt o7}\verb| = |hehe
\smallskip

and nets: ({\tt tex Net} fixed on vanilla)
\smallskip
% start M2
\begin{verbatim}
i8 : "haha"||"hoho"
\end{verbatim}
\noindent\underline{\tt o8}\verb| = |\begin{tabular}[t]{l}haha\\
hoho\end{tabular}
\smallskip


\section{Help}
\smallskip
% start M2
\begin{verbatim}
i9 : help det
\end{verbatim}
\noindent\underline{\tt o9}\verb| = |
\par \medskip\noindent\begingroup\Large\bf
determinant -- determinant of a matrix\endgroup
\par \smallskip%

\par \medskip\noindent\begingroup\Large\bf
Synopsis\endgroup
\par \smallskip%
\begin{itemize}
\item 
\par Usage: 
\par \begingroup\tt det\ M\endgroup{}
\item Inputs:\begin{itemize}
\item \begingroup\tt M\endgroup{}, a square \begingroup\tt matrix\endgroup{}
\end{itemize}

\item \begingroup\tt Optional\ inputs\endgroup{}:\begin{itemize}
\item \begingroup\tt Strategy\endgroup{}\begingroup\tt \ ={\char 62}\ \endgroup{}\begingroup\tt ...\endgroup{}, default value null, choose between Bareiss and Cofactor algorithms
\end{itemize}

\item Outputs:\begin{itemize}
\item a \begingroup\tt ring\ element\endgroup{}, which is the determinant of \begingroup\tt M\endgroup{}
\end{itemize}

\end{itemize}

\par \medskip\noindent\begingroup\Large\bf
Description\endgroup
\par \smallskip%

\par \medskip\noindent\begingroup\Large\bf
See also\endgroup
\par \smallskip%
\begin{itemize}
\item \begingroup\tt exteriorPower\endgroup{} -- exterior power
\item \begingroup\tt minors\endgroup{} -- ideal generated by minors
\item \begingroup\tt permanents\endgroup{} -- ideal generated by square permanents of a matrix
\item \begingroup\tt pfaffians\endgroup{} -- ideal generated by Pfaffians
\end{itemize}

\par \medskip\noindent\begingroup\Large\bf
Ways to use \begingroup\tt determinant\endgroup{} :\endgroup
\par \smallskip%
\begin{itemize}
\item \begingroup\tt {\char 34}determinant(Matrix){\char 34}\endgroup{}
\item \begingroup\tt {\char 34}determinant(MutableMatrix){\char 34}\endgroup{}
\end{itemize}

\par \medskip\noindent\begingroup\Large\bf
For the programmer\endgroup
\par \smallskip%

\par The object \begingroup\tt determinant\endgroup{} is a \begingroup\tt method\ function\ with\ options\endgroup{}.

\noindent\underline{\tt o9}\verb| : |$\texttt{DIV}$
\smallskip


\section{packages}
packages that have a {\tt tex} output will work:
\smallskip
% start M2
\begin{verbatim}
i10 : needsPackage "Posets";
\end{verbatim}
% start M2
\begin{verbatim}
i11 : booleanLattice 3
\end{verbatim}
\noindent\underline{\tt o11}\verb| = |\begin{tikzpicture}[scale=1, vertices/.style={draw, fill=black, circle, inner sep=0pt}]
	\node [vertices] (0) at (-0+0,0){};
	\node [vertices] (1) at (-1.5+0,1.33333){};
	\node [vertices] (2) at (-1.5+1.5,1.33333){};
	\node [vertices] (4) at (-1.5+3,1.33333){};
	\node [vertices] (3) at (-1.5+0,2.66667){};
	\node [vertices] (5) at (-1.5+1.5,2.66667){};
	\node [vertices] (6) at (-1.5+3,2.66667){};
	\node [vertices] (7) at (-0+0,4){};
\foreach \to/\from in {0/1, 2/3, 0/2, 1/3, 4/5, 6/7, 4/6, 5/7, 0/4, 1/5, 2/6, 3/7}
\draw [-] (\to)--(\from);
\end{tikzpicture}


\noindent\underline{\tt o11}\verb| : |$\texttt{Poset}$
\smallskip


\section{multi-line example}
\smallskip
% start M2
\begin{verbatim}
i12 : f = i -> (
      i+1
      )
\end{verbatim}
\noindent\underline{\tt o12}\verb| = |$\texttt{f}$

\noindent\underline{\tt o12}\verb| : |$\texttt{FunctionClosure}$
\smallskip



\smallskip
% start M2
\begin{verbatim}
i13 : I=ideal 0; f = i -> (
\end{verbatim}

\noindent\underline{\tt o13}\verb| : |$\texttt{Ideal}$ of ${\mathbb Z}$
\begin{verbatim}
      i+1)
\end{verbatim}
\noindent\underline{\tt o14}\verb| = |$\texttt{f}$

\noindent\underline{\tt o14}\verb| : |$\texttt{FunctionClosure}$
\smallskip


\smallskip
% start M2
\begin{verbatim}
i15 : a=1;b=2;
\end{verbatim}
% start M2
\begin{verbatim}
i17 : c=3;
\end{verbatim}
\smallskip


\end{document}
